----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]           2,368
       BatchNorm2d-2         [-1, 64, 224, 224]             128
            Conv2d-3         [-1, 64, 224, 224]          36,928
       BatchNorm2d-4         [-1, 64, 224, 224]             128
            Conv2d-5         [-1, 64, 224, 224]          36,928
       BatchNorm2d-6         [-1, 64, 224, 224]             128
            Conv2d-7         [-1, 64, 224, 224]          36,928
       BatchNorm2d-8         [-1, 64, 224, 224]             128
         MaxPool2d-9         [-1, 64, 112, 112]               0
           Conv2d-10         [-1, 64, 112, 112]          36,928
      BatchNorm2d-11         [-1, 64, 112, 112]             128
           Conv2d-12         [-1, 64, 112, 112]          36,928
      BatchNorm2d-13         [-1, 64, 112, 112]             128
        MaxPool2d-14           [-1, 64, 56, 56]               0
           Conv2d-15           [-1, 64, 56, 56]          36,928
      BatchNorm2d-16           [-1, 64, 56, 56]             128
           Conv2d-17           [-1, 64, 56, 56]          36,928
      BatchNorm2d-18           [-1, 64, 56, 56]             128
           Conv2d-19           [-1, 64, 56, 56]          36,928
      BatchNorm2d-20           [-1, 64, 56, 56]             128
           Conv2d-21           [-1, 64, 56, 56]          36,928
      BatchNorm2d-22           [-1, 64, 56, 56]             128
    ResidualBlock-23           [-1, 64, 56, 56]               0
           Conv2d-24           [-1, 64, 56, 56]          36,928
      BatchNorm2d-25           [-1, 64, 56, 56]             128
           Conv2d-26           [-1, 64, 56, 56]          36,928
      BatchNorm2d-27           [-1, 64, 56, 56]             128
    ResidualBlock-28           [-1, 64, 56, 56]               0
           Conv2d-29           [-1, 64, 56, 56]          36,928
      BatchNorm2d-30           [-1, 64, 56, 56]             128
           Conv2d-31           [-1, 64, 56, 56]          36,928
      BatchNorm2d-32           [-1, 64, 56, 56]             128
    ResidualBlock-33           [-1, 64, 56, 56]               0
           Conv2d-34          [-1, 128, 56, 56]         147,584
          Sigmoid-35          [-1, 128, 56, 56]               0
   PixelAttention-36          [-1, 128, 56, 56]               0
AdaptiveAvgPool2d-37            [-1, 128, 1, 1]               0
           Conv2d-38              [-1, 8, 1, 1]           1,024
             ReLU-39              [-1, 8, 1, 1]               0
           Conv2d-40            [-1, 128, 1, 1]           1,024
          Sigmoid-41            [-1, 128, 1, 1]               0
 ChannelAttention-42          [-1, 128, 56, 56]               0
MultiDimensionalAttentionFusion-43          [-1, 128, 56, 56]               0
  ConvTranspose2d-44         [-1, 64, 112, 112]         131,136
      BatchNorm2d-45         [-1, 64, 112, 112]             128
           Conv2d-46        [-1, 128, 112, 112]         147,584
          Sigmoid-47        [-1, 128, 112, 112]               0
   PixelAttention-48        [-1, 128, 112, 112]               0
AdaptiveAvgPool2d-49            [-1, 128, 1, 1]               0
           Conv2d-50              [-1, 8, 1, 1]           1,024
             ReLU-51              [-1, 8, 1, 1]               0
           Conv2d-52            [-1, 128, 1, 1]           1,024
          Sigmoid-53            [-1, 128, 1, 1]               0
 ChannelAttention-54        [-1, 128, 112, 112]               0
MultiDimensionalAttentionFusion-55        [-1, 128, 112, 112]               0
  ConvTranspose2d-56         [-1, 64, 224, 224]         131,136
      BatchNorm2d-57         [-1, 64, 224, 224]             128
          Dropout-58         [-1, 64, 224, 224]               0
           Conv2d-59          [-1, 1, 224, 224]             577
          Dropout-60         [-1, 64, 224, 224]               0
           Conv2d-61          [-1, 1, 224, 224]             577
          Dropout-62         [-1, 64, 224, 224]               0
           Conv2d-63          [-1, 1, 224, 224]             577
          Dropout-64         [-1, 64, 224, 224]               0
           Conv2d-65          [-1, 1, 224, 224]             577
================================================================
Total params: 1,048,324
Trainable params: 1,048,324
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 494.60
Params size (MB): 4.00
Estimated Total Size (MB): 499.36
----------------------------------------------------------------
