----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1        [-1, 128, 224, 224]           4,736
       BatchNorm2d-2        [-1, 128, 224, 224]             256
            Conv2d-3        [-1, 128, 224, 224]         147,584
       BatchNorm2d-4        [-1, 128, 224, 224]             256
            Conv2d-5        [-1, 128, 224, 224]         147,584
       BatchNorm2d-6        [-1, 128, 224, 224]             256
            Conv2d-7        [-1, 128, 224, 224]         147,584
       BatchNorm2d-8        [-1, 128, 224, 224]             256
         MaxPool2d-9        [-1, 128, 112, 112]               0
           Conv2d-10        [-1, 128, 112, 112]         147,584
      BatchNorm2d-11        [-1, 128, 112, 112]             256
           Conv2d-12        [-1, 128, 112, 112]         147,584
      BatchNorm2d-13        [-1, 128, 112, 112]             256
        MaxPool2d-14          [-1, 128, 56, 56]               0
           Conv2d-15          [-1, 128, 56, 56]         147,584
      BatchNorm2d-16          [-1, 128, 56, 56]             256
           Conv2d-17          [-1, 128, 56, 56]         147,584
      BatchNorm2d-18          [-1, 128, 56, 56]             256
           Conv2d-19          [-1, 128, 56, 56]         147,584
      BatchNorm2d-20          [-1, 128, 56, 56]             256
           Conv2d-21          [-1, 128, 56, 56]         147,584
      BatchNorm2d-22          [-1, 128, 56, 56]             256
    ResidualBlock-23          [-1, 128, 56, 56]               0
           Conv2d-24          [-1, 128, 56, 56]         147,584
      BatchNorm2d-25          [-1, 128, 56, 56]             256
           Conv2d-26          [-1, 128, 56, 56]         147,584
      BatchNorm2d-27          [-1, 128, 56, 56]             256
    ResidualBlock-28          [-1, 128, 56, 56]               0
           Conv2d-29          [-1, 128, 56, 56]         147,584
      BatchNorm2d-30          [-1, 128, 56, 56]             256
           Conv2d-31          [-1, 128, 56, 56]         147,584
      BatchNorm2d-32          [-1, 128, 56, 56]             256
    ResidualBlock-33          [-1, 128, 56, 56]               0
           Conv2d-34           [-1, 32, 56, 56]           4,128
      BatchNorm2d-35           [-1, 32, 56, 56]              64
           Conv2d-36           [-1, 32, 56, 56]           9,248
      BatchNorm2d-37           [-1, 32, 56, 56]              64
           Conv2d-38           [-1, 32, 56, 56]           4,128
      BatchNorm2d-39           [-1, 32, 56, 56]              64
           Conv2d-40           [-1, 32, 56, 56]           9,248
      BatchNorm2d-41           [-1, 32, 56, 56]              64
           Conv2d-42           [-1, 32, 56, 56]           9,248
      BatchNorm2d-43           [-1, 32, 56, 56]              64
           Conv2d-44           [-1, 16, 56, 56]           2,064
      BatchNorm2d-45           [-1, 16, 56, 56]              32
           Conv2d-46           [-1, 32, 56, 56]           4,640
      BatchNorm2d-47           [-1, 32, 56, 56]              64
           Conv2d-48           [-1, 32, 56, 56]           9,248
      BatchNorm2d-49           [-1, 32, 56, 56]              64
           Conv2d-50           [-1, 64, 56, 56]           8,256
      BatchNorm2d-51           [-1, 64, 56, 56]             128
           Conv2d-52           [-1, 96, 56, 56]          43,104
      BatchNorm2d-53           [-1, 96, 56, 56]             192
           Conv2d-54           [-1, 96, 56, 56]          64,608
      BatchNorm2d-55           [-1, 96, 56, 56]             192
           Conv2d-56           [-1, 32, 56, 56]          27,680
      BatchNorm2d-57           [-1, 32, 56, 56]              64
           Conv2d-58          [-1, 128, 56, 56]          16,512
      BatchNorm2d-59          [-1, 128, 56, 56]             256
           Conv2d-60          [-1, 128, 56, 56]          16,512
      BatchNorm2d-61          [-1, 128, 56, 56]             256
ReceptiveFieldBlock-62          [-1, 128, 56, 56]               0
           Conv2d-63          [-1, 256, 56, 56]         590,080
          Sigmoid-64          [-1, 256, 56, 56]               0
   PixelAttention-65          [-1, 256, 56, 56]               0
AdaptiveAvgPool2d-66            [-1, 256, 1, 1]               0
           Conv2d-67             [-1, 16, 1, 1]           4,096
             ReLU-68             [-1, 16, 1, 1]               0
           Conv2d-69            [-1, 256, 1, 1]           4,096
          Sigmoid-70            [-1, 256, 1, 1]               0
 ChannelAttention-71          [-1, 256, 56, 56]               0
MultiDimensionalAttentionFusion-72          [-1, 256, 56, 56]               0
  ConvTranspose2d-73        [-1, 128, 112, 112]         524,416
      BatchNorm2d-74        [-1, 128, 112, 112]             256
           Conv2d-75        [-1, 256, 112, 112]         590,080
          Sigmoid-76        [-1, 256, 112, 112]               0
   PixelAttention-77        [-1, 256, 112, 112]               0
AdaptiveAvgPool2d-78            [-1, 256, 1, 1]               0
           Conv2d-79             [-1, 16, 1, 1]           4,096
             ReLU-80             [-1, 16, 1, 1]               0
           Conv2d-81            [-1, 256, 1, 1]           4,096
          Sigmoid-82            [-1, 256, 1, 1]               0
 ChannelAttention-83        [-1, 256, 112, 112]               0
MultiDimensionalAttentionFusion-84        [-1, 256, 112, 112]               0
  ConvTranspose2d-85        [-1, 128, 224, 224]         524,416
      BatchNorm2d-86        [-1, 128, 224, 224]             256
          Dropout-87        [-1, 128, 224, 224]               0
           Conv2d-88          [-1, 1, 224, 224]           1,153
          Dropout-89        [-1, 128, 224, 224]               0
           Conv2d-90          [-1, 1, 224, 224]           1,153
          Dropout-91        [-1, 128, 224, 224]               0
           Conv2d-92          [-1, 1, 224, 224]           1,153
          Dropout-93        [-1, 128, 224, 224]               0
           Conv2d-94          [-1, 1, 224, 224]           1,153
================================================================
Total params: 4,407,604
Trainable params: 4,407,604
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 1028.25
Params size (MB): 16.81
Estimated Total Size (MB): 1045.83
----------------------------------------------------------------
