----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]          10,400
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 64, 112, 112]          32,832
       BatchNorm2d-4         [-1, 64, 112, 112]             128
            Conv2d-5          [-1, 128, 56, 56]         131,200
       BatchNorm2d-6          [-1, 128, 56, 56]             256
            Conv2d-7          [-1, 128, 56, 56]         147,584
       BatchNorm2d-8          [-1, 128, 56, 56]             256
            Conv2d-9          [-1, 128, 56, 56]         147,584
      BatchNorm2d-10          [-1, 128, 56, 56]             256
    ResidualBlock-11          [-1, 128, 56, 56]               0
           Conv2d-12          [-1, 128, 56, 56]         147,584
      BatchNorm2d-13          [-1, 128, 56, 56]             256
           Conv2d-14          [-1, 128, 56, 56]         147,584
      BatchNorm2d-15          [-1, 128, 56, 56]             256
    ResidualBlock-16          [-1, 128, 56, 56]               0
           Conv2d-17          [-1, 128, 56, 56]         147,584
      BatchNorm2d-18          [-1, 128, 56, 56]             256
           Conv2d-19          [-1, 128, 56, 56]         147,584
      BatchNorm2d-20          [-1, 128, 56, 56]             256
    ResidualBlock-21          [-1, 128, 56, 56]               0
           Conv2d-22          [-1, 128, 56, 56]         147,584
      BatchNorm2d-23          [-1, 128, 56, 56]             256
           Conv2d-24          [-1, 128, 56, 56]         147,584
      BatchNorm2d-25          [-1, 128, 56, 56]             256
    ResidualBlock-26          [-1, 128, 56, 56]               0
           Conv2d-27          [-1, 128, 56, 56]         147,584
      BatchNorm2d-28          [-1, 128, 56, 56]             256
           Conv2d-29          [-1, 128, 56, 56]         147,584
      BatchNorm2d-30          [-1, 128, 56, 56]             256
    ResidualBlock-31          [-1, 128, 56, 56]               0
           Conv2d-32           [-1, 32, 56, 56]           4,128
      BatchNorm2d-33           [-1, 32, 56, 56]              64
           Conv2d-34           [-1, 32, 56, 56]           9,248
      BatchNorm2d-35           [-1, 32, 56, 56]              64
           Conv2d-36           [-1, 32, 56, 56]           4,128
      BatchNorm2d-37           [-1, 32, 56, 56]              64
           Conv2d-38           [-1, 32, 56, 56]           9,248
      BatchNorm2d-39           [-1, 32, 56, 56]              64
           Conv2d-40           [-1, 32, 56, 56]           9,248
      BatchNorm2d-41           [-1, 32, 56, 56]              64
           Conv2d-42           [-1, 16, 56, 56]           2,064
      BatchNorm2d-43           [-1, 16, 56, 56]              32
           Conv2d-44           [-1, 32, 56, 56]           4,640
      BatchNorm2d-45           [-1, 32, 56, 56]              64
           Conv2d-46           [-1, 32, 56, 56]           9,248
      BatchNorm2d-47           [-1, 32, 56, 56]              64
           Conv2d-48           [-1, 64, 56, 56]           8,256
      BatchNorm2d-49           [-1, 64, 56, 56]             128
           Conv2d-50           [-1, 96, 56, 56]          43,104
      BatchNorm2d-51           [-1, 96, 56, 56]             192
           Conv2d-52           [-1, 96, 56, 56]          64,608
      BatchNorm2d-53           [-1, 96, 56, 56]             192
           Conv2d-54           [-1, 32, 56, 56]          27,680
      BatchNorm2d-55           [-1, 32, 56, 56]              64
           Conv2d-56          [-1, 128, 56, 56]          16,512
      BatchNorm2d-57          [-1, 128, 56, 56]             256
           Conv2d-58          [-1, 128, 56, 56]          16,512
      BatchNorm2d-59          [-1, 128, 56, 56]             256
ReceptiveFieldBlock-60          [-1, 128, 56, 56]               0
  ConvTranspose2d-61         [-1, 64, 113, 113]         131,136
      BatchNorm2d-62         [-1, 64, 113, 113]             128
  ConvTranspose2d-63         [-1, 32, 225, 225]          32,800
      BatchNorm2d-64         [-1, 32, 225, 225]              64
  ConvTranspose2d-65         [-1, 32, 225, 225]          82,976
          Dropout-66         [-1, 32, 225, 225]               0
           Conv2d-67          [-1, 1, 224, 224]             129
          Dropout-68         [-1, 32, 225, 225]               0
           Conv2d-69          [-1, 1, 224, 224]             129
          Dropout-70         [-1, 32, 225, 225]               0
           Conv2d-71          [-1, 1, 224, 224]             129
          Dropout-72         [-1, 32, 225, 225]               0
           Conv2d-73          [-1, 1, 224, 224]             129
================================================================
Total params: 2,131,092
Trainable params: 2,131,092
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 260.53
Params size (MB): 8.13
Estimated Total Size (MB): 269.43
----------------------------------------------------------------
