----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]           1,184
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 32, 224, 224]           9,248
       BatchNorm2d-4         [-1, 32, 224, 224]              64
            Conv2d-5         [-1, 32, 224, 224]           9,248
       BatchNorm2d-6         [-1, 32, 224, 224]              64
            Conv2d-7         [-1, 32, 224, 224]           9,248
       BatchNorm2d-8         [-1, 32, 224, 224]              64
         MaxPool2d-9         [-1, 32, 112, 112]               0
           Conv2d-10         [-1, 32, 112, 112]           9,248
      BatchNorm2d-11         [-1, 32, 112, 112]              64
           Conv2d-12         [-1, 32, 112, 112]           9,248
      BatchNorm2d-13         [-1, 32, 112, 112]              64
        MaxPool2d-14           [-1, 32, 56, 56]               0
           Conv2d-15           [-1, 32, 56, 56]           9,248
      BatchNorm2d-16           [-1, 32, 56, 56]              64
           Conv2d-17           [-1, 32, 56, 56]           9,248
      BatchNorm2d-18           [-1, 32, 56, 56]              64
           Conv2d-19           [-1, 32, 56, 56]           9,248
      BatchNorm2d-20           [-1, 32, 56, 56]              64
           Conv2d-21           [-1, 32, 56, 56]           9,248
      BatchNorm2d-22           [-1, 32, 56, 56]              64
    ResidualBlock-23           [-1, 32, 56, 56]               0
           Conv2d-24           [-1, 32, 56, 56]           9,248
      BatchNorm2d-25           [-1, 32, 56, 56]              64
           Conv2d-26           [-1, 32, 56, 56]           9,248
      BatchNorm2d-27           [-1, 32, 56, 56]              64
    ResidualBlock-28           [-1, 32, 56, 56]               0
           Conv2d-29           [-1, 32, 56, 56]           9,248
      BatchNorm2d-30           [-1, 32, 56, 56]              64
           Conv2d-31           [-1, 32, 56, 56]           9,248
      BatchNorm2d-32           [-1, 32, 56, 56]              64
    ResidualBlock-33           [-1, 32, 56, 56]               0
           Conv2d-34           [-1, 64, 56, 56]          36,928
          Sigmoid-35           [-1, 64, 56, 56]               0
   PixelAttention-36           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-37             [-1, 64, 1, 1]               0
           Conv2d-38              [-1, 4, 1, 1]             256
             ReLU-39              [-1, 4, 1, 1]               0
           Conv2d-40             [-1, 64, 1, 1]             256
          Sigmoid-41             [-1, 64, 1, 1]               0
 ChannelAttention-42           [-1, 64, 56, 56]               0
MultiDimensionalAttentionFusion-43           [-1, 64, 56, 56]               0
  ConvTranspose2d-44         [-1, 32, 112, 112]          32,800
      BatchNorm2d-45         [-1, 32, 112, 112]              64
           Conv2d-46         [-1, 64, 112, 112]          36,928
          Sigmoid-47         [-1, 64, 112, 112]               0
   PixelAttention-48         [-1, 64, 112, 112]               0
AdaptiveAvgPool2d-49             [-1, 64, 1, 1]               0
           Conv2d-50              [-1, 4, 1, 1]             256
             ReLU-51              [-1, 4, 1, 1]               0
           Conv2d-52             [-1, 64, 1, 1]             256
          Sigmoid-53             [-1, 64, 1, 1]               0
 ChannelAttention-54         [-1, 64, 112, 112]               0
MultiDimensionalAttentionFusion-55         [-1, 64, 112, 112]               0
  ConvTranspose2d-56         [-1, 32, 224, 224]          32,800
      BatchNorm2d-57         [-1, 32, 224, 224]              64
          Dropout-58         [-1, 32, 224, 224]               0
           Conv2d-59          [-1, 1, 224, 224]             289
          Dropout-60         [-1, 32, 224, 224]               0
           Conv2d-61          [-1, 1, 224, 224]             289
          Dropout-62         [-1, 32, 224, 224]               0
           Conv2d-63          [-1, 1, 224, 224]             289
          Dropout-64         [-1, 32, 224, 224]               0
           Conv2d-65          [-1, 1, 224, 224]             289
================================================================
Total params: 264,068
Trainable params: 264,068
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 248.07
Params size (MB): 1.01
Estimated Total Size (MB): 249.84
----------------------------------------------------------------
