----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]          10,400
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 64, 112, 112]          32,832
       BatchNorm2d-4         [-1, 64, 112, 112]             128
            Conv2d-5          [-1, 128, 56, 56]         131,200
       BatchNorm2d-6          [-1, 128, 56, 56]             256
            Conv2d-7          [-1, 128, 56, 56]         147,584
       BatchNorm2d-8          [-1, 128, 56, 56]             256
            Conv2d-9          [-1, 128, 56, 56]         147,584
      BatchNorm2d-10          [-1, 128, 56, 56]             256
    ResidualBlock-11          [-1, 128, 56, 56]               0
  ConvTranspose2d-12         [-1, 64, 113, 113]         131,136
      BatchNorm2d-13         [-1, 64, 113, 113]             128
  ConvTranspose2d-14         [-1, 32, 225, 225]          32,800
      BatchNorm2d-15         [-1, 32, 225, 225]              64
  ConvTranspose2d-16         [-1, 32, 225, 225]          82,976
          Dropout-17         [-1, 32, 225, 225]               0
           Conv2d-18          [-1, 1, 224, 224]             129
          Dropout-19         [-1, 32, 225, 225]               0
           Conv2d-20          [-1, 1, 224, 224]             129
          Dropout-21         [-1, 32, 225, 225]               0
           Conv2d-22          [-1, 1, 224, 224]             129
          Dropout-23         [-1, 32, 225, 225]               0
           Conv2d-24          [-1, 1, 224, 224]             129
================================================================
Total params: 718,180
Trainable params: 718,180
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 158.71
Params size (MB): 2.74
Estimated Total Size (MB): 162.21
----------------------------------------------------------------
