----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]          10,400
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 64, 112, 112]          32,832
       BatchNorm2d-4         [-1, 64, 112, 112]             128
            Conv2d-5          [-1, 128, 56, 56]         131,200
       BatchNorm2d-6          [-1, 128, 56, 56]             256
            Conv2d-7          [-1, 128, 56, 56]         147,584
       BatchNorm2d-8          [-1, 128, 56, 56]             256
            Conv2d-9          [-1, 128, 56, 56]         147,584
      BatchNorm2d-10          [-1, 128, 56, 56]             256
    ResidualBlock-11          [-1, 128, 56, 56]               0
           Conv2d-12          [-1, 128, 56, 56]         147,584
      BatchNorm2d-13          [-1, 128, 56, 56]             256
           Conv2d-14          [-1, 128, 56, 56]         147,584
      BatchNorm2d-15          [-1, 128, 56, 56]             256
    ResidualBlock-16          [-1, 128, 56, 56]               0
           Conv2d-17          [-1, 128, 56, 56]         147,584
      BatchNorm2d-18          [-1, 128, 56, 56]             256
           Conv2d-19          [-1, 128, 56, 56]         147,584
      BatchNorm2d-20          [-1, 128, 56, 56]             256
    ResidualBlock-21          [-1, 128, 56, 56]               0
           Conv2d-22          [-1, 128, 56, 56]         147,584
      BatchNorm2d-23          [-1, 128, 56, 56]             256
           Conv2d-24          [-1, 128, 56, 56]         147,584
      BatchNorm2d-25          [-1, 128, 56, 56]             256
    ResidualBlock-26          [-1, 128, 56, 56]               0
           Conv2d-27          [-1, 128, 56, 56]         147,584
      BatchNorm2d-28          [-1, 128, 56, 56]             256
           Conv2d-29          [-1, 128, 56, 56]         147,584
      BatchNorm2d-30          [-1, 128, 56, 56]             256
    ResidualBlock-31          [-1, 128, 56, 56]               0
  ConvTranspose2d-32         [-1, 64, 223, 223]         131,136
      BatchNorm2d-33         [-1, 64, 223, 223]             128
  ConvTranspose2d-34         [-1, 32, 445, 445]          32,800
      BatchNorm2d-35         [-1, 32, 445, 445]              64
  ConvTranspose2d-36         [-1, 32, 889, 889]           9,248
          Dropout-37         [-1, 32, 889, 889]               0
           Conv2d-38          [-1, 1, 892, 892]             129
          Dropout-39         [-1, 32, 889, 889]               0
           Conv2d-40          [-1, 1, 892, 892]             129
          Dropout-41         [-1, 32, 889, 889]               0
           Conv2d-42          [-1, 1, 892, 892]             129
          Dropout-43         [-1, 32, 889, 889]               0
           Conv2d-44          [-1, 1, 892, 892]             129
================================================================
Total params: 1,827,172
Trainable params: 1,827,172
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 1253.72
Params size (MB): 6.97
Estimated Total Size (MB): 1261.46
----------------------------------------------------------------
