----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]           2,368
       BatchNorm2d-2         [-1, 64, 224, 224]             128
            Conv2d-3         [-1, 64, 224, 224]          36,928
       BatchNorm2d-4         [-1, 64, 224, 224]             128
            Conv2d-5         [-1, 64, 224, 224]          36,928
       BatchNorm2d-6         [-1, 64, 224, 224]             128
            Conv2d-7         [-1, 64, 224, 224]          36,928
       BatchNorm2d-8         [-1, 64, 224, 224]             128
         MaxPool2d-9         [-1, 64, 112, 112]               0
           Conv2d-10         [-1, 64, 112, 112]          36,928
      BatchNorm2d-11         [-1, 64, 112, 112]             128
           Conv2d-12         [-1, 64, 112, 112]          36,928
      BatchNorm2d-13         [-1, 64, 112, 112]             128
        MaxPool2d-14           [-1, 64, 56, 56]               0
           Conv2d-15           [-1, 64, 56, 56]          36,928
      BatchNorm2d-16           [-1, 64, 56, 56]             128
           Conv2d-17           [-1, 64, 56, 56]          36,928
      BatchNorm2d-18           [-1, 64, 56, 56]             128
           Conv2d-19           [-1, 64, 56, 56]          36,928
      BatchNorm2d-20           [-1, 64, 56, 56]             128
           Conv2d-21           [-1, 64, 56, 56]          36,928
      BatchNorm2d-22           [-1, 64, 56, 56]             128
    ResidualBlock-23           [-1, 64, 56, 56]               0
           Conv2d-24           [-1, 64, 56, 56]          36,928
      BatchNorm2d-25           [-1, 64, 56, 56]             128
           Conv2d-26           [-1, 64, 56, 56]          36,928
      BatchNorm2d-27           [-1, 64, 56, 56]             128
    ResidualBlock-28           [-1, 64, 56, 56]               0
           Conv2d-29           [-1, 64, 56, 56]          36,928
      BatchNorm2d-30           [-1, 64, 56, 56]             128
           Conv2d-31           [-1, 64, 56, 56]          36,928
      BatchNorm2d-32           [-1, 64, 56, 56]             128
    ResidualBlock-33           [-1, 64, 56, 56]               0
           Conv2d-34           [-1, 16, 56, 56]           1,040
      BatchNorm2d-35           [-1, 16, 56, 56]              32
           Conv2d-36           [-1, 16, 56, 56]           2,320
      BatchNorm2d-37           [-1, 16, 56, 56]              32
           Conv2d-38           [-1, 16, 56, 56]           1,040
      BatchNorm2d-39           [-1, 16, 56, 56]              32
           Conv2d-40           [-1, 16, 56, 56]           2,320
      BatchNorm2d-41           [-1, 16, 56, 56]              32
           Conv2d-42           [-1, 16, 56, 56]           2,320
      BatchNorm2d-43           [-1, 16, 56, 56]              32
           Conv2d-44            [-1, 8, 56, 56]             520
      BatchNorm2d-45            [-1, 8, 56, 56]              16
           Conv2d-46           [-1, 16, 56, 56]           1,168
      BatchNorm2d-47           [-1, 16, 56, 56]              32
           Conv2d-48           [-1, 16, 56, 56]           2,320
      BatchNorm2d-49           [-1, 16, 56, 56]              32
           Conv2d-50           [-1, 32, 56, 56]           2,080
      BatchNorm2d-51           [-1, 32, 56, 56]              64
           Conv2d-52           [-1, 48, 56, 56]          10,800
      BatchNorm2d-53           [-1, 48, 56, 56]              96
           Conv2d-54           [-1, 48, 56, 56]          16,176
      BatchNorm2d-55           [-1, 48, 56, 56]              96
           Conv2d-56           [-1, 16, 56, 56]           6,928
      BatchNorm2d-57           [-1, 16, 56, 56]              32
           Conv2d-58           [-1, 64, 56, 56]           4,160
      BatchNorm2d-59           [-1, 64, 56, 56]             128
           Conv2d-60           [-1, 64, 56, 56]           4,160
      BatchNorm2d-61           [-1, 64, 56, 56]             128
ReceptiveFieldBlock-62           [-1, 64, 56, 56]               0
           Conv2d-63          [-1, 128, 56, 56]         147,584
          Sigmoid-64          [-1, 128, 56, 56]               0
   PixelAttention-65          [-1, 128, 56, 56]               0
AdaptiveAvgPool2d-66            [-1, 128, 1, 1]               0
           Conv2d-67              [-1, 8, 1, 1]           1,024
             ReLU-68              [-1, 8, 1, 1]               0
           Conv2d-69            [-1, 128, 1, 1]           1,024
          Sigmoid-70            [-1, 128, 1, 1]               0
 ChannelAttention-71          [-1, 128, 56, 56]               0
MultiDimensionalAttentionFusion-72          [-1, 128, 56, 56]               0
  ConvTranspose2d-73         [-1, 64, 112, 112]         131,136
      BatchNorm2d-74         [-1, 64, 112, 112]             128
           Conv2d-75        [-1, 128, 112, 112]         147,584
          Sigmoid-76        [-1, 128, 112, 112]               0
   PixelAttention-77        [-1, 128, 112, 112]               0
AdaptiveAvgPool2d-78            [-1, 128, 1, 1]               0
           Conv2d-79              [-1, 8, 1, 1]           1,024
             ReLU-80              [-1, 8, 1, 1]               0
           Conv2d-81            [-1, 128, 1, 1]           1,024
          Sigmoid-82            [-1, 128, 1, 1]               0
 ChannelAttention-83        [-1, 128, 112, 112]               0
MultiDimensionalAttentionFusion-84        [-1, 128, 112, 112]               0
  ConvTranspose2d-85         [-1, 64, 224, 224]         131,136
      BatchNorm2d-86         [-1, 64, 224, 224]             128
          Dropout-87         [-1, 64, 224, 224]               0
           Conv2d-88          [-1, 1, 224, 224]             577
          Dropout-89         [-1, 64, 224, 224]               0
           Conv2d-90          [-1, 1, 224, 224]             577
          Dropout-91         [-1, 64, 224, 224]               0
           Conv2d-92          [-1, 1, 224, 224]             577
          Dropout-93         [-1, 64, 224, 224]               0
           Conv2d-94          [-1, 1, 224, 224]             577
================================================================
Total params: 1,106,460
Trainable params: 1,106,460
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 514.89
Params size (MB): 4.22
Estimated Total Size (MB): 519.88
----------------------------------------------------------------
