----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]          10,400
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 64, 112, 112]          32,832
       BatchNorm2d-4         [-1, 64, 112, 112]             128
            Conv2d-5          [-1, 128, 56, 56]         131,200
       BatchNorm2d-6          [-1, 128, 56, 56]             256
            Conv2d-7          [-1, 128, 56, 56]         147,584
       BatchNorm2d-8          [-1, 128, 56, 56]             256
            Conv2d-9          [-1, 128, 56, 56]         147,584
      BatchNorm2d-10          [-1, 128, 56, 56]             256
    ResidualBlock-11          [-1, 128, 56, 56]               0
           Conv2d-12          [-1, 128, 56, 56]         147,584
      BatchNorm2d-13          [-1, 128, 56, 56]             256
           Conv2d-14          [-1, 128, 56, 56]         147,584
      BatchNorm2d-15          [-1, 128, 56, 56]             256
    ResidualBlock-16          [-1, 128, 56, 56]               0
           Conv2d-17          [-1, 128, 56, 56]         147,584
      BatchNorm2d-18          [-1, 128, 56, 56]             256
           Conv2d-19          [-1, 128, 56, 56]         147,584
      BatchNorm2d-20          [-1, 128, 56, 56]             256
    ResidualBlock-21          [-1, 128, 56, 56]               0
           Conv2d-22          [-1, 128, 56, 56]         147,584
      BatchNorm2d-23          [-1, 128, 56, 56]             256
           Conv2d-24          [-1, 128, 56, 56]         147,584
      BatchNorm2d-25          [-1, 128, 56, 56]             256
    ResidualBlock-26          [-1, 128, 56, 56]               0
           Conv2d-27          [-1, 128, 56, 56]         147,584
      BatchNorm2d-28          [-1, 128, 56, 56]             256
           Conv2d-29          [-1, 128, 56, 56]         147,584
      BatchNorm2d-30          [-1, 128, 56, 56]             256
    ResidualBlock-31          [-1, 128, 56, 56]               0
           Conv2d-32          [-1, 256, 56, 56]         590,080
          Sigmoid-33          [-1, 256, 56, 56]               0
   PixelAttention-34          [-1, 256, 56, 56]               0
AdaptiveAvgPool2d-35            [-1, 256, 1, 1]               0
           Conv2d-36             [-1, 16, 1, 1]           4,096
             ReLU-37             [-1, 16, 1, 1]               0
           Conv2d-38            [-1, 256, 1, 1]           4,096
          Sigmoid-39            [-1, 256, 1, 1]               0
 ChannelAttention-40          [-1, 256, 56, 56]               0
MultiDimensionalAttentionFusion-41          [-1, 256, 56, 56]               0
  ConvTranspose2d-42         [-1, 64, 113, 113]         262,208
      BatchNorm2d-43         [-1, 64, 113, 113]             128
  ConvTranspose2d-44         [-1, 32, 225, 225]          32,800
      BatchNorm2d-45         [-1, 32, 225, 225]              64
  ConvTranspose2d-46         [-1, 32, 225, 225]          82,976
          Dropout-47         [-1, 32, 225, 225]               0
           Conv2d-48          [-1, 1, 224, 224]             129
          Dropout-49         [-1, 32, 225, 225]               0
           Conv2d-50          [-1, 1, 224, 224]             129
          Dropout-51         [-1, 32, 225, 225]               0
           Conv2d-52          [-1, 1, 224, 224]             129
          Dropout-53         [-1, 32, 225, 225]               0
           Conv2d-54          [-1, 1, 224, 224]             129
================================================================
Total params: 2,630,244
Trainable params: 2,630,244
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 250.59
Params size (MB): 10.03
Estimated Total Size (MB): 261.39
----------------------------------------------------------------
