----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]          10,400
       BatchNorm2d-2         [-1, 32, 224, 224]              64
         MaxPool2d-3         [-1, 32, 224, 224]               0
            Conv2d-4         [-1, 64, 112, 112]          32,832
       BatchNorm2d-5         [-1, 64, 112, 112]             128
         MaxPool2d-6         [-1, 64, 112, 112]               0
            Conv2d-7          [-1, 128, 56, 56]         131,200
       BatchNorm2d-8          [-1, 128, 56, 56]             256
            Conv2d-9          [-1, 128, 56, 56]         147,584
      BatchNorm2d-10          [-1, 128, 56, 56]             256
           Conv2d-11          [-1, 128, 56, 56]         147,584
      BatchNorm2d-12          [-1, 128, 56, 56]             256
    ResidualBlock-13          [-1, 128, 56, 56]               0
           Conv2d-14          [-1, 128, 56, 56]         147,584
      BatchNorm2d-15          [-1, 128, 56, 56]             256
           Conv2d-16          [-1, 128, 56, 56]         147,584
      BatchNorm2d-17          [-1, 128, 56, 56]             256
    ResidualBlock-18          [-1, 128, 56, 56]               0
           Conv2d-19          [-1, 128, 56, 56]         147,584
      BatchNorm2d-20          [-1, 128, 56, 56]             256
           Conv2d-21          [-1, 128, 56, 56]         147,584
      BatchNorm2d-22          [-1, 128, 56, 56]             256
    ResidualBlock-23          [-1, 128, 56, 56]               0
           Conv2d-24          [-1, 128, 56, 56]         147,584
      BatchNorm2d-25          [-1, 128, 56, 56]             256
           Conv2d-26          [-1, 128, 56, 56]         147,584
      BatchNorm2d-27          [-1, 128, 56, 56]             256
    ResidualBlock-28          [-1, 128, 56, 56]               0
           Conv2d-29          [-1, 128, 56, 56]         147,584
      BatchNorm2d-30          [-1, 128, 56, 56]             256
           Conv2d-31          [-1, 128, 56, 56]         147,584
      BatchNorm2d-32          [-1, 128, 56, 56]             256
    ResidualBlock-33          [-1, 128, 56, 56]               0
  ConvTranspose2d-34         [-1, 64, 113, 113]         131,136
      BatchNorm2d-35         [-1, 64, 113, 113]             128
  ConvTranspose2d-36         [-1, 32, 225, 225]          32,800
      BatchNorm2d-37         [-1, 32, 225, 225]              64
  ConvTranspose2d-38         [-1, 32, 225, 225]          82,976
          Dropout-39         [-1, 32, 225, 225]               0
           Conv2d-40          [-1, 1, 224, 224]             129
          Dropout-41         [-1, 32, 225, 225]               0
           Conv2d-42          [-1, 1, 224, 224]             129
          Dropout-43         [-1, 32, 225, 225]               0
           Conv2d-44          [-1, 1, 224, 224]             129
          Dropout-45         [-1, 32, 225, 225]               0
           Conv2d-46          [-1, 1, 224, 224]             129
================================================================
Total params: 1,900,900
Trainable params: 1,900,900
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 238.33
Params size (MB): 7.25
Estimated Total Size (MB): 246.35
----------------------------------------------------------------
