----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]           1,184
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 32, 224, 224]           9,248
       BatchNorm2d-4         [-1, 32, 224, 224]              64
            Conv2d-5         [-1, 32, 224, 224]           9,248
       BatchNorm2d-6         [-1, 32, 224, 224]              64
            Conv2d-7         [-1, 32, 224, 224]           9,248
       BatchNorm2d-8         [-1, 32, 224, 224]              64
         MaxPool2d-9         [-1, 32, 112, 112]               0
           Conv2d-10         [-1, 32, 112, 112]           9,248
      BatchNorm2d-11         [-1, 32, 112, 112]              64
           Conv2d-12         [-1, 32, 112, 112]           9,248
      BatchNorm2d-13         [-1, 32, 112, 112]              64
        MaxPool2d-14           [-1, 32, 56, 56]               0
           Conv2d-15           [-1, 32, 56, 56]           9,248
      BatchNorm2d-16           [-1, 32, 56, 56]              64
           Conv2d-17           [-1, 32, 56, 56]           9,248
      BatchNorm2d-18           [-1, 32, 56, 56]              64
           Conv2d-19           [-1, 32, 56, 56]           9,248
      BatchNorm2d-20           [-1, 32, 56, 56]              64
           Conv2d-21           [-1, 32, 56, 56]           9,248
      BatchNorm2d-22           [-1, 32, 56, 56]              64
    ResidualBlock-23           [-1, 32, 56, 56]               0
           Conv2d-24           [-1, 32, 56, 56]           9,248
      BatchNorm2d-25           [-1, 32, 56, 56]              64
           Conv2d-26           [-1, 32, 56, 56]           9,248
      BatchNorm2d-27           [-1, 32, 56, 56]              64
    ResidualBlock-28           [-1, 32, 56, 56]               0
           Conv2d-29           [-1, 32, 56, 56]           9,248
      BatchNorm2d-30           [-1, 32, 56, 56]              64
           Conv2d-31           [-1, 32, 56, 56]           9,248
      BatchNorm2d-32           [-1, 32, 56, 56]              64
    ResidualBlock-33           [-1, 32, 56, 56]               0
           Conv2d-34            [-1, 8, 56, 56]             264
      BatchNorm2d-35            [-1, 8, 56, 56]              16
           Conv2d-36            [-1, 8, 56, 56]             584
      BatchNorm2d-37            [-1, 8, 56, 56]              16
           Conv2d-38            [-1, 8, 56, 56]             264
      BatchNorm2d-39            [-1, 8, 56, 56]              16
           Conv2d-40            [-1, 8, 56, 56]             584
      BatchNorm2d-41            [-1, 8, 56, 56]              16
           Conv2d-42            [-1, 8, 56, 56]             584
      BatchNorm2d-43            [-1, 8, 56, 56]              16
           Conv2d-44            [-1, 4, 56, 56]             132
      BatchNorm2d-45            [-1, 4, 56, 56]               8
           Conv2d-46            [-1, 8, 56, 56]             296
      BatchNorm2d-47            [-1, 8, 56, 56]              16
           Conv2d-48            [-1, 8, 56, 56]             584
      BatchNorm2d-49            [-1, 8, 56, 56]              16
           Conv2d-50           [-1, 16, 56, 56]             528
      BatchNorm2d-51           [-1, 16, 56, 56]              32
           Conv2d-52           [-1, 24, 56, 56]           2,712
      BatchNorm2d-53           [-1, 24, 56, 56]              48
           Conv2d-54           [-1, 24, 56, 56]           4,056
      BatchNorm2d-55           [-1, 24, 56, 56]              48
           Conv2d-56            [-1, 8, 56, 56]           1,736
      BatchNorm2d-57            [-1, 8, 56, 56]              16
           Conv2d-58           [-1, 32, 56, 56]           1,056
      BatchNorm2d-59           [-1, 32, 56, 56]              64
           Conv2d-60           [-1, 32, 56, 56]           1,056
      BatchNorm2d-61           [-1, 32, 56, 56]              64
ReceptiveFieldBlock-62           [-1, 32, 56, 56]               0
           Conv2d-63           [-1, 64, 56, 56]          36,928
          Sigmoid-64           [-1, 64, 56, 56]               0
   PixelAttention-65           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-66             [-1, 64, 1, 1]               0
           Conv2d-67              [-1, 4, 1, 1]             256
             ReLU-68              [-1, 4, 1, 1]               0
           Conv2d-69             [-1, 64, 1, 1]             256
          Sigmoid-70             [-1, 64, 1, 1]               0
 ChannelAttention-71           [-1, 64, 56, 56]               0
MultiDimensionalAttentionFusion-72           [-1, 64, 56, 56]               0
  ConvTranspose2d-73         [-1, 32, 112, 112]          32,800
      BatchNorm2d-74         [-1, 32, 112, 112]              64
  ConvTranspose2d-75         [-1, 32, 224, 224]          16,416
      BatchNorm2d-76         [-1, 32, 224, 224]              64
          Dropout-77         [-1, 32, 224, 224]               0
           Conv2d-78          [-1, 1, 224, 224]             289
          Dropout-79         [-1, 32, 224, 224]               0
           Conv2d-80          [-1, 1, 224, 224]             289
          Dropout-81         [-1, 32, 224, 224]               0
           Conv2d-82          [-1, 1, 224, 224]             289
          Dropout-83         [-1, 32, 224, 224]               0
           Conv2d-84          [-1, 1, 224, 224]             289
================================================================
Total params: 225,072
Trainable params: 225,072
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 227.58
Params size (MB): 0.86
Estimated Total Size (MB): 229.21
----------------------------------------------------------------
