----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]           1,184
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 32, 224, 224]           9,248
       BatchNorm2d-4         [-1, 32, 224, 224]              64
            Conv2d-5         [-1, 32, 224, 224]           9,248
       BatchNorm2d-6         [-1, 32, 224, 224]              64
            Conv2d-7         [-1, 32, 224, 224]           9,248
       BatchNorm2d-8         [-1, 32, 224, 224]              64
            Conv2d-9         [-1, 32, 224, 224]           9,248
      BatchNorm2d-10         [-1, 32, 224, 224]              64
           Conv2d-11         [-1, 32, 224, 224]           9,248
      BatchNorm2d-12         [-1, 32, 224, 224]              64
           Conv2d-13         [-1, 32, 224, 224]           9,248
      BatchNorm2d-14         [-1, 32, 224, 224]              64
           Conv2d-15         [-1, 32, 224, 224]           9,248
      BatchNorm2d-16         [-1, 32, 224, 224]              64
           Conv2d-17         [-1, 32, 224, 224]           9,248
      BatchNorm2d-18         [-1, 32, 224, 224]              64
           Conv2d-19         [-1, 32, 224, 224]           9,248
      BatchNorm2d-20         [-1, 32, 224, 224]              64
    ResidualBlock-21         [-1, 32, 224, 224]               0
           Conv2d-22         [-1, 32, 224, 224]           9,248
      BatchNorm2d-23         [-1, 32, 224, 224]              64
           Conv2d-24         [-1, 32, 224, 224]           9,248
      BatchNorm2d-25         [-1, 32, 224, 224]              64
    ResidualBlock-26         [-1, 32, 224, 224]               0
           Conv2d-27         [-1, 32, 224, 224]           9,248
      BatchNorm2d-28         [-1, 32, 224, 224]              64
           Conv2d-29         [-1, 32, 224, 224]           9,248
      BatchNorm2d-30         [-1, 32, 224, 224]              64
    ResidualBlock-31         [-1, 32, 224, 224]               0
           Conv2d-32          [-1, 8, 224, 224]             264
      BatchNorm2d-33          [-1, 8, 224, 224]              16
           Conv2d-34          [-1, 8, 224, 224]             584
      BatchNorm2d-35          [-1, 8, 224, 224]              16
           Conv2d-36          [-1, 8, 224, 224]             264
      BatchNorm2d-37          [-1, 8, 224, 224]              16
           Conv2d-38          [-1, 8, 224, 224]             584
      BatchNorm2d-39          [-1, 8, 224, 224]              16
           Conv2d-40          [-1, 8, 224, 224]             584
      BatchNorm2d-41          [-1, 8, 224, 224]              16
           Conv2d-42          [-1, 4, 224, 224]             132
      BatchNorm2d-43          [-1, 4, 224, 224]               8
           Conv2d-44          [-1, 8, 224, 224]             296
      BatchNorm2d-45          [-1, 8, 224, 224]              16
           Conv2d-46          [-1, 8, 224, 224]             584
      BatchNorm2d-47          [-1, 8, 224, 224]              16
           Conv2d-48         [-1, 16, 224, 224]             528
      BatchNorm2d-49         [-1, 16, 224, 224]              32
           Conv2d-50         [-1, 24, 224, 224]           2,712
      BatchNorm2d-51         [-1, 24, 224, 224]              48
           Conv2d-52         [-1, 24, 224, 224]           4,056
      BatchNorm2d-53         [-1, 24, 224, 224]              48
           Conv2d-54          [-1, 8, 224, 224]           1,736
      BatchNorm2d-55          [-1, 8, 224, 224]              16
           Conv2d-56         [-1, 32, 224, 224]           1,056
      BatchNorm2d-57         [-1, 32, 224, 224]              64
           Conv2d-58         [-1, 32, 224, 224]           1,056
      BatchNorm2d-59         [-1, 32, 224, 224]              64
ReceptiveFieldBlock-60         [-1, 32, 224, 224]               0
           Conv2d-61         [-1, 64, 224, 224]          36,928
          Sigmoid-62         [-1, 64, 224, 224]               0
   PixelAttention-63         [-1, 64, 224, 224]               0
AdaptiveAvgPool2d-64             [-1, 64, 1, 1]               0
           Conv2d-65              [-1, 4, 1, 1]             256
             ReLU-66              [-1, 4, 1, 1]               0
           Conv2d-67             [-1, 64, 1, 1]             256
          Sigmoid-68             [-1, 64, 1, 1]               0
 ChannelAttention-69         [-1, 64, 224, 224]               0
MultiDimensionalAttentionFusion-70         [-1, 64, 224, 224]               0
  ConvTranspose2d-71         [-1, 32, 448, 448]          32,800
      BatchNorm2d-72         [-1, 32, 448, 448]              64
           Conv2d-73         [-1, 64, 448, 448]          36,928
          Sigmoid-74         [-1, 64, 448, 448]               0
   PixelAttention-75         [-1, 64, 448, 448]               0
AdaptiveAvgPool2d-76             [-1, 64, 1, 1]               0
           Conv2d-77              [-1, 4, 1, 1]             256
             ReLU-78              [-1, 4, 1, 1]               0
           Conv2d-79             [-1, 64, 1, 1]             256
          Sigmoid-80             [-1, 64, 1, 1]               0
 ChannelAttention-81         [-1, 64, 448, 448]               0
MultiDimensionalAttentionFusion-82         [-1, 64, 448, 448]               0
  ConvTranspose2d-83         [-1, 32, 896, 896]          32,800
      BatchNorm2d-84         [-1, 32, 896, 896]              64
          Dropout-85         [-1, 32, 224, 224]               0
           Conv2d-86          [-1, 1, 224, 224]             289
          Dropout-87         [-1, 32, 224, 224]               0
           Conv2d-88          [-1, 1, 224, 224]             289
          Dropout-89         [-1, 32, 224, 224]               0
           Conv2d-90          [-1, 1, 224, 224]             289
          Dropout-91         [-1, 32, 224, 224]               0
           Conv2d-92          [-1, 1, 224, 224]             289
================================================================
Total params: 278,896
Trainable params: 278,896
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 1695.10
Params size (MB): 1.06
Estimated Total Size (MB): 1696.93
----------------------------------------------------------------
